######################################################################################################################################################
######################################################################################################################################################

#FATORES - EXIBIÇÃO

######################################################################################################################################################
######################################################################################################################################################

#-----------------------------------------------------------------------------------------------------------------------------------------------------
#/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
#EXIBINDO FATORES

  niveis <- c("PE", "CE", "SP", "AM")
  
  rotulos <- c("Pernambuco", "Ceará", "São Paulo", "Amazonas")
  
  valores <- c("PE", "CE", "SP", "SP", "PE", "SP", "AM", "AM", "PE", "SP", "CE")
  
  resultado <- factor(valores, labels = rotulos, ordered = FALSE, levels = niveis)

#A função print() para fatores

#Podemos utilizar a função print() para exibir os fatores criados

  print(resultado)

##Dfinindo se os valores dos fatores devem ser exibidos com as pas ou não. Por padrão é FALSE

  print(resultado, quote = FALSE)
  
  print(resultado, quote = TRUE)

#Na parte de baixo da impressão dos valores do fator, podemos ver a listagem de 'levels' que temos. Podemos definir quantos desses queremos que 
#sejam exibidos. Abaixo, exibimos apenas um.

  print(resultado, max.levels = 1)

#Caso o número informado seja maior do que a quantidade real de fatores, a quantidade total dos fatores será exibida

  print(resultado, max.levels = 10)

#/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
#INFORMAÇÕES DE FATORES

#Saber o número de níveis

nlevels(resultado)

#-----------------------------------------------------------------------------------------------------------------------------------------------------
#Saber quais são os níveis

levels(resultado)

#-----------------------------------------------------------------------------------------------------------------------------------------------------
#Determinando a categoria mais baixa (necessário ser ordinal)

min(resultado)

#-----------------------------------------------------------------------------------------------------------------------------------------------------
#Determinando a caregoria mais alta (necessário ser ordinal)

max(resultado) 

#-----------------------------------------------------------------------------------------------------------------------------------------------------
#Verificando se é ordenado

is.ordered(resultado)

#-----------------------------------------------------------------------------------------------------------------------------------------------------
#/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
#VERIFICANDO SE É FATOR

#Dados que são fatores

is.factor(resultado)

class(resultado)

#-----------------------------------------------------------------------------------------------------------------------------------------------------
#Dados que não são fatores

is.factor(mtcars$gear)

class(mtcars$gear)

#-----------------------------------------------------------------------------------------------------------------------------------------------------
#/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
#CONVERTENDO PARA FATOR

#Transformando os valores em fatores com a função factor()

dados <- factor(mtcars$gear)

is.factor(dados)

class(dados)

#-----------------------------------------------------------------------------------------------------------------------------------------------------  
#Convertendo para fator com uma função de coerção

dados <- as.factor(mtcars$gear)

is.factor(dados)

class(dados)

#----------------------------------------------------------------------------------------------------------------------------------------------------- 