######################################################################################################################################################
######################################################################################################################################################

#APRESENTAÇÃO

######################################################################################################################################################
######################################################################################################################################################

#-----------------------------------------------------------------------------------------------------------------------------------------------------
#/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
#HISTÓRIA DO R

#-----------------------------------------------------------------------------------------------------------------------------------------------------
#/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
#CARACTERÍSTICAS DO R

#Linguagem interpretada
#Orientada a objetos
#Linguagem de script
#É case-sensitive

#-----------------------------------------------------------------------------------------------------------------------------------------------------
#/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
#FUNCIONAMENTO DO R

#As funções do R podem tanto serem usadas como forma de consulta como de atribuição

  names(objeto)

  names(objeto) <- c("nome1","nome2")

#-----------------------------------------------------------------------------------------------------------------------------------------------------
#Parâmetros das funções
#As funções em R possuem parâmetros. Alguns são obrigatórios; outros não.
#Os argumentos obrigatórios são chamados de argumentos não nomeados e os argumentos opcionais são os argumentos nomeados.
#Os argumentos não nomeados são mostrados sem valores na ajuda da função enquanto os nomeados mostram valores.
#Os valores dos parâmetros mostrados na ajuda são os seus valores padrões. 
#Caso não se informe os valores dos parâmetros nomeados, serão utilizados os valores padrão.
  
#Na função runif(), n é obrigatório e min e max são parâmetros opcionais cujos valores padrão são 0 e 1 respectivamente.
  
  runif(n, min=0, max=1)
  
#-----------------------------------------------------------------------------------------------------------------------------------------------------
#/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
#BOAS PRÁTICAS
  
#Comentários
#Nomear objetos efêmeros (aqueles usados dentro de uma mesma seção) com nomes curtos
#Nomear objetos persistentes (aqueles usados entre seções distintas) com nomes significativos
  
#-----------------------------------------------------------------------------------------------------------------------------------------------------
#/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
#EXPRESSÕES
  
#Para colocar duas expressões ou mais numa mesma linha, usamos o ponto-e-vírgula  
  
  x <- c(1, 2, 3); x

  y <- c(2, 3, 0); z <- c(-2, -3, 0); y + z
  
  
#-----------------------------------------------------------------------------------------------------------------------------------------------------
#/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////  
#DOCUMENTAÇÃO
  
#Para documentar o nosso trabalho, podemos usar a função history()  
#Damos um parâmetro numérico para a função history(), digamos p e ela mostrá as p últimas declarações feitas (não inputs)
#Assim, podemos copiar e salvar esse texto num script e ditá-lo.
  
  history(30)
  
#-----------------------------------------------------------------------------------------------------------------------------------------------------
#/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////  
#CONTROLE DE PRECISÃO
  
#Para controlar qauntos dígitos R mostra nas suas operações, fazemos:
#Após fazermos isso, os cálculos na presente seção serão exibidos com esta precisão
  
  options(digits = 3)
  

  
  
#-----------------------------------------------------------------------------------------------------------------------------------------------------