######################################################################################################################################################
######################################################################################################################################################

#FUNÇÕES - CRIAÇÃO

######################################################################################################################################################
######################################################################################################################################################

#-----------------------------------------------------------------------------------------------------------------------------------------------------
#/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
#CRIAÇÃO DE FUNÇÕES

#A impressão da frase faz parte da função neste exemplo
#Não énecessário return

  nova = function(string){
    
    msg = paste("Mensagem", string, sep = ": ")
    
    print(msg)
  }
  
  nova("Olá,mundo!")
  
#-----------------------------------------------------------------------------------------------------------------------------------------------------  
#Podemos armazenar o retorno da função em uma variável
#A impressão da mensagem é externa à função
#Necessário usar return para que o computador saiba o que retornar
  
  nova = function(string){
    
    msg = paste("Mensagem", string, sep = ": ")
    
    return(msg)
  }
  
  frase = nova("Olá,mundo!")
  
  print(frase)

#-----------------------------------------------------------------------------------------------------------------------------------------------------  
#Caso não haja o return, o último valor da função será retornado
  
  nova = function(string){
    
    msg = paste("Mensagem", string, sep = ": ")
    
    toupper(msg)
    
  }
  
  frase = nova("Olá,mundo!")
  
  print(frase)
  
#-----------------------------------------------------------------------------------------------------------------------------------------------------
#Funções (função lambda)
#É um recurso para escrever uma função em uma única linha
  
  nova = function(string) msg = paste("Mensagem", string, sep = ": ");
  
  frase = nova("Olá,mundo!")
  
  print(frase)

#-----------------------------------------------------------------------------------------------------------------------------------------------------
#Visualizando o código de funções
#Digitando no prompt o nome da função sem os parênteses ou rodando-o sem os parênteses no script,podemos ver o código da função
  
  nova
  
  
  
  
#-----------------------------------------------------------------------------------------------------------------------------------------------------