######################################################################################################################################################
######################################################################################################################################################

#ENTRADA E SAÍDA

######################################################################################################################################################
######################################################################################################################################################

#-----------------------------------------------------------------------------------------------------------------------------------------------------
#/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
#/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
#SAÍDA SIMPLES DE DADOS

#Impressão de dados
#Imprimindo constantes
#Basta usar a função print() com a constante

  print(5L)
  print(3.85)
  print('a')
  print("b")
  print(FALSE)
  print(1-3i)
  print(61E99)

#-----------------------------------------------------------------------------------------------------------------------------------------------------
#Imprimindo variáveis
#Basta usar a função print() com a variável
  
  x <- 5L
  x <- 5.5
  x <- 'a'
  x <- "b"
  x <- "cachorro"
  x <- TRUE
  x <- 2-3i
  x <- 55E23

  print(x)
  
#-----------------------------------------------------------------------------------------------------------------------------------------------------
#Imprimindo strings
#Diretamente
  
  print('Olá, mundo!')
  
  print("Olá, mundo!")
  
#Imprimindo strings por variável  
  
  msg1 <- "Nada a ver!"
    
  msg2 <- "Tudo a ver!"
  
  print(msg1)
  
  print(msg2)
  
#-----------------------------------------------------------------------------------------------------------------------------------------------------
#/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
#/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
#SAÍDA CONCATENADA
  
#A função paste() exibe a forma concatenada das strings no console, mas pode ser necessário garantir isso
#Para isso, sempre combinamos a função paste() com a função print() quando queremos exibir  
  
  msg1 <- "Estamos aqui!"
  
  msg2 <- 'Venha também.'
  
  paste(msg1, msg2)
  
  print(paste(msg1, msg2)) 

#-----------------------------------------------------------------------------------------------------------------------------------------------------  
#Saída expressa
#Imprime automaticamente
  
  cat("O valor é:", 155)
  
  cat("O valor é:", 155, ", bocó!")

#Linhas impressas separadamente
  
  cat("Estou","vendo", "uma linda", "nuvem", fill = 3) 
  
#Rótulos para as linhas impressas separadamente
  
  cat("Estou","vendo", "uma linda", "nuvem", fill = 2, labels = c("1", "2", "3", "4")) 
  
#Concatena e cria um arquivo com os valores dentro dele
  
  cat("Estou","vendo", "uma linda", "nuvem", file = "C:\\Users\\Leandro Luz\\Desktop\\bizu2.txt", append = TRUE)
  
  cat("O valor é:", 155, ", bocó!", file = "C:\\Users\\Leandro Luz\\Desktop\\bizu2.txt", append = FALSE)
  
#Dando uma organização do arquivo em linhas
  
  cat("Estou","vendo", "uma linda", "nuvem", "\n", file = "C:\\Users\\Leandro Luz\\Desktop\\bizu2.txt", append = FALSE)
  
  cat("O valor é:", 155, ", bocó!", file = "C:\\Users\\Leandro Luz\\Desktop\\bizu2.txt", append = TRUE)
  
#-----------------------------------------------------------------------------------------------------------------------------------------------------
#concatenando várias variáveis  
  
  peso <- 399
  
  nome <- "Maria"
  
  cat(nome, "pesa", peso, "quilos!")
  
#-----------------------------------------------------------------------------------------------------------------------------------------------------
#/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
#/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
#SAÍDA FORMATADA

#Formatação de números  
#Paste converte para character 
  
#Justificando números à esquerda

  mensagem <- format(15.33 , width = 20, justify = "l")
  
  print(mensagem)
  
#-----------------------------------------------------------------------------------------------------------------------------------------------------
#Justificando números ao centro 
  
  mensagem = format(15.33 , width = 20, justify = "c")
  
  print(mensagem)
  
#-----------------------------------------------------------------------------------------------------------------------------------------------------
#Justificando números à direita
  
  mensagem = format(15.33 , width = 20, justify = "r")
  
  print(mensagem) 

#-----------------------------------------------------------------------------------------------------------------------------------------------------  
#Definindo o número de dígitos significativos para numeric e complex
  
  format(3.345456, width = 20, justify = "c", digits = 3)

#-----------------------------------------------------------------------------------------------------------------------------------------------------  
#Definindo se quer em notação científica
  
  format(3.345456, width = 20, justify = "c", scientific = TRUE) 

#-----------------------------------------------------------------------------------------------------------------------------------------------------
#Formatação de strings()

#Justificando texto à esquerda (left)
  
  format("Olá, mundo!", width = 20, justify = "l")
  
#Justificando texto à direita (right)
  
  format("Olá, mundo!", width = 20, justify = "r")
  
#Justificando texto ao centro (center)
  
  format("Olá, mundo!", width = 20, justify = "c")
  
#Justificando texto ao centro (none)  
  
  format("Olá, mundo!", width = 20, justify = "n")
  
#-----------------------------------------------------------------------------------------------------------------------------------------------------
#Maiúsculas e minúsculas  
#Maiúsculas
  
  toupper("Olá, mundo!")
  
#Minúsculas
  
  tolower("Olá, mundo!")
    
#-----------------------------------------------------------------------------------------------------------------------------------------------------
#/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
#/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
#ENTRADA DE DADOS
  
#A função readline() serve para ler um valor na tela
  
  readline()

#-----------------------------------------------------------------------------------------------------------------------------------------------------  
#Podemos armazenar o valor em uma variável
  
  x <- readline()
  
#-----------------------------------------------------------------------------------------------------------------------------------------------------
#Armazenar um valor enviando uma mensagem
  
  x <- readline(prompt = "Digite um valor: ")
  
#Ou omitindo o parâmetro
  
  x <- readline("Digite um valor: ")

#-----------------------------------------------------------------------------------------------------------------------------------------------------  
#Cuidados com readline()
#Rodando um script com 'source' (não funciona com run)
  
  nome<-readline("Digite seu nome: ")

  idade<-readline("Informe sua idade: ")

  res<-paste("O aluno ", nome, " tem ", idade, "anos de idade")

  print(res)


#-----------------------------------------------------------------------------------------------------------------------------------------------------  